# 다이제스트 인증
기본인증은 평문으로 아이디와 비밀번호를 보내기에 전혀 안전하지않은 인증법.
SSL과 결합해서 사용하는 방법이 안전하게 기본인증을 사용하는 유일한 방법.
## 다이제스트 인증의 개선점
다이제스트 인증은 기본 인증의 심각한 결함을 수정한 또 다른 HTTP 인증 프로토콜
- 비밀번호를 절대 네트워크를 통해 평문으로 전송하지 않음.
- 인증 체결을 가로채서 재현하려는 악의적인 사람들을 차단함.
- 구현에 따라 메시지 내용 위조를 막는것 도 가능.
- 그 외 몇몇 잘 알려진 형태의 공격을 막음.

다이제스트 인증은 안전하고, 강력한 프로토콜은 아니다.
안전한 HTTP 트랜잭션을 위해선 TLS와 HTTPs가 더 적합한 프로토콜이다.
기본인증을 대체하기위해 설계된 만큼 기본인증보다는 훨씬 강력하다.
### 비밀번호를 안전하게 지키기 위해 요약 사용하기.
다이제스트 인증 : 절대 비밀번호를 네트워크를 통해 보내지 않는다.

비밀번호 대신 지문/요약만 보낸다.

클라이언트와 서버는 둘 다 비밀번호를 알고 있으므로 클라이언트로부터 전달받은 요약이 비밀번호에 알맞게 대응한다면 서버는 클라이언트를 신뢰할 수 있다.
### 단방향 요약
정보 본문의 압축
JWT의 시그니쳐에도 사용.
Base64(헤더)+′ . ′+Base64(페이로드)+′ . ′+Base64(H(헤더,페이로드))
### 재전송 방지를 위한 난스 사용
암호화 하더라도 평문으로 전송하지 않을 뿐 비밀번호와 다름이 없다.
누군가 가로채 재전송한다면 문제가 발생할 수 있다.
이를 방지하기위해 난스(nonce)를 사용한다.
난스는 자주 바뀌는 증표로 이를 비밀번호에 섞어 난스가 바뀔 때 마다 요약도 바뀌게 만들어 준다.
다이제스트 인증은 난스 사용을 요구해 이런 재전송 공격을 방지한다.
